clase04-artilleryClusterDocker/00-artilleryRun-claseAnterior/prueba1.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  phases:
    - duration: 5
      arrivalRate: 5
      # rampTo: 5
      name: Warm up phase
    - duration: 5
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 5
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
    - duration: 5
      arrivalRate: 5
      # rampTo: 5
      name: Down phase      
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  # plugins:
  #   ensure:
  #     thresholds:
  #       - http.response_time.p99: 100
  #       - http.response_time.p95: 75
  #   apdex:
  #     threshold: 100
  #   metrics-by-endpoint: {}
scenarios:
  - flow:
      # - loop:
      - get:
          url: '/usuario'
      - post:
          url: '/api/sessions/registro'
      - post:
          url: '/api/sessions/login'
        # count: 100